app/views/admin/items/edit.html.erb

SELECT "genres".* FROM "genres"
---
    <%= f.label :ジャンル %>
    <%= f.collection_select(:genre_id, Genre.all, :id, :name, {prompt: "--選択してください--"}, {class: "form-control-select"}) %>