app/views/admin/items/new.html.erb

SELECT "genres".* FROM "genres"
---
          <td><%= f.label :ジャンル %></td>
          <td><%= f.collection_select(:genre_id, Genre.all, :id, :name, prompt: "--選択してください--") %></td>