app/controllers/admin/customers_controller.rb

SELECT  "customers".* FROM "customers" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
---
  def index
    @customers = Customer.all.page(params[:page]).per(10)