app/controllers/admin/genres_controller.rb

INSERT INTO "genres" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "プリン"], ["created_at", "2021-10-23 06:09:54.241692"], ["updated_at", "2021-10-23 06:09:54.241692"]]
---
  def create
    @genre = Genre.new(genre_params)
    @genre.save

SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def update
    @genre = Genre.find(params[:id])