app/controllers/admin/items_controller.rb

  def index
    @items = Item.all.page(params[:page]).per(10)
---
SELECT  "items".* FROM "items" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]

  def create
    @item = Item.new(item_params)
    @item.save
---
INSERT INTO "items" ("genre_id", "name", "image_id", "introduction", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    @item = Item.find(params[:id])
    @item.update(item_params)
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "items" SET "image_id" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["image_id", "c6b28783b7e0ff6d33812066f9b0738cd4ef26bbef14053e01f6a41c3aeb"], ["updated_at", "2021-10-23 06:10:37.623282"], ["id", 1]]