app/controllers/customers/sessions_controller.rb

SELECT  "customers".* FROM "customers" WHERE "customers"."email" = ? LIMIT ?  [["email", "a@a"], ["LIMIT", 1]]
---
  def reject_inactive_customer #退会済みユーザーのログイン拒否
    @customer = Customer.find_by(email: params[:customer][:email].downcase)