app/controllers/public/addresses_controller.rb

INSERT INTO "addresses" ("customer_id", "name", "postal_code", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["customer_id", 1], ["name", "あいうえお"], ["postal_code", "1234567"], ["address", "あいうえお"], ["created_at", "2021-10-24 05:56:13.850208"], ["updated_at", "2021-10-24 05:56:13.850208"]]
---
  def create
    @address = Address.new(address_params)
    @address.customer_id = current_customer.id
    if @address.save

SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "addresses" SET "address" = ?, "name" = ?, "updated_at" = ? WHERE "addresses"."id" = ?  [["address", "あいうえおか"], ["name", "あいうえおか"], ["updated_at", "2021-10-24 06:10:39.506576"], ["id", 1]]
---
  def update
    @address = Address.find(params[:id])
    if @address.update(address_params)

SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "addresses" WHERE "addresses"."id" = ?  [["id", 2]]
---
  def destroy
    @address = Address.find(params[:id])
    @address.destroy