app/controllers/public/cart_items_controller.rb

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "cart_items" SET "amount" = ?, "updated_at" = ? WHERE "cart_items"."id" = ?  [["amount", 2], ["updated_at", "2021-10-24 06:55:10.704238"], ["id", 1]]
---
  def update
    @cart_item = CartItem.find(params[:id])
    @cart_item.update(cart_item_params)

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 1]]
---
  def destroy
    @cart_item = CartItem.find(params[:id])
    @cart_item.destroy

INSERT INTO "cart_items" ("item_id", "customer_id", "amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["item_id", 1], ["customer_id", 1], ["amount", 4], ["created_at", "2021-10-23 11:28:11.379363"], ["updated_at", "2021-10-23 11:28:11.379363"]]
---
  def create
    if current_customer.cart_items.find_by(item_id: params[:cart_item][:item_id]).present?
      @cartitem = current_customer.cart_items.find_by(item_id: params[:cart_item][:item_id]) #customer_id = current_customer.id は既に存在しているカラムなので不要。
      @cartitem.amount += params[:cart_item][:amount].to_i
      @cartitem.save
      redirect_to cart_items_path
    else
      @cart_item = CartItem.new(cart_item_params)
      @cart_item.customer_id = current_customer.id
      @cart_item.save