app/controllers/public/items_controller.rb

  def index
    @items = Item.where(is_active: true).page(params[:page]).per(8)
---
SELECT  "items".* FROM "items" WHERE "items"."is_active" = ? LIMIT ? OFFSET ?  [["is_active", 1], ["LIMIT", 8], ["OFFSET", 0]]
SELECT COUNT(*) FROM "items" WHERE "items"."is_active" = ?  [["is_active", 1]]