app/controllers/public/orders_controller.rb

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ?  [["customer_id", 1]]
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def confirm
    @order = Order.new(order_params)
    @cart_items = current_customer.cart_items
    @order.shipping_fee = 800

    if params[:order][:select_address] == "0" #ご自身の住所
       @order.postal_code = current_customer.postal_code
       @order.address = current_customer.address
       @order.name = current_customer.last_name + current_customer.first_name

    elsif params[:order][:select_address] == "1" #登録済み住所
       @address = Address.find(params[:order][:address_id])

INSERT INTO "orders" ("customer_id", "postal_code", "address", "name", "shipping_fee", "amount_billed", "payment_method", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ?  [["customer_id", 1]]
INSERT INTO "order_details" ("item_id", "order_id", "price", "amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["item_id", 1], ["order_id", 1], ["price", 1320], ["amount", 2], ["created_at", "2021-10-24 07:09:59.305996"], ["updated_at", "2021-10-24 07:09:59.305996"]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 1]]
---
  def create
    @order = Order.new(order_params)
    @order.customer_id = current_customer.id
    @order.shipping_fee = 800
    @order.save
    current_customer.cart_items.each do |cart_item|
      @order_detail = OrderDetail.new
      @order_detail.order_id =  @order.id
      @order_detail.item_id = cart_item.item_id
      @order_detail.amount = cart_item.amount
      @order_detail.price = cart_item.subtotal
      @order_detail.save
      end
      redirect_to orders_thanks_path
      current_customer.cart_items.destroy_all

SELECT  "orders".* FROM "orders" WHERE "orders"."customer_id" = ? LIMIT ? OFFSET ?  [["customer_id", 1], ["LIMIT", 8], ["OFFSET", 0]]
---
  def index
    @orders = current_customer.orders.page(params[:page]).per(8)

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? ORDER BY "customers"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @order = Order.find(params[:id])
    @order.customer_id = current_customer.id
    @order_details = @order.order_details