app/views/public/items/index.html.erb

    商品一覧
    <span class="item_count">全<%= Item.where(is_active: "販売可").count %>件</span>
---
SELECT COUNT(*) FROM "items" WHERE "items"."is_active" = ?  [["is_active", 1]]